app/Http/Controllers/ApiProductController.php

    public function index(){
        return Products::all();
---
select * from `product` where `product`.`deleted_at` is null

    public function getProductById($id){
        $pro = Products::find($id);
---
select * from `product` where `product`.`id` = '7' and `product`.`deleted_at` is null limit 1