app/Http/Controllers/CartItemController.php

    public function add_cart(Request $request){
        $product_id = $request->product_id;
        #$user_id = Auth::user()->id;
        $user_id= 1;
        $sessionCartId =  Session::get('cart_id');

        if($sessionCartId == null){
            $cart = Cart::create([
                'user_id' => $user_id
            ]);
            Session::put('cart_id', $cart->id );
        }

        $cartCreado = CartItem::create([
            'cart_id' => Session::get('cart_id'),
            'product_id' => $product_id,
            'cantidad' => 1
        ]);
---
insert into `carts` (`user_id`, `updated_at`, `created_at`) values (1, '2023-11-18 19:26:04', '2023-11-18 19:26:04')
insert into `cart_items` (`cart_id`, `product_id`, `cantidad`, `updated_at`, `created_at`) values (1, '1', 1, '2023-11-18 19:26:04', '2023-11-18 19:26:04')