app/Http/Controllers/HomeController.php

select * from `product` where `product`.`deleted_at` is null limit 12 offset 0
select count(*) as aggregate from `product` where `product`.`deleted_at` is null
---
    public function home(){
        $products = Products::paginate(12);

select * from `product` where `product`.`deleted_at` is null limit 12 offset 0
select count(*) as aggregate from `product` where `product`.`deleted_at` is null
---
    public function home2(Request $request){
        $products = Products::paginate(12);

select * from `product` where `name` like '%dolor%' and `product`.`deleted_at` is null
---
    public function search(Request $request)
    {

        $searchQuery = $request->input('search');

        $products = Products::where('name', 'like', '%' . $searchQuery . '%')
            ->get(); // Cambia el número 10 por la cantidad de resultados por página que desees